In [2]:
import pandas as pd
import numpy as np

***Data Manipulation with Pandas***

**Filtering and Selecting Data**

In [3]:
#creating DataFrame using python Dictionary
data = {
    "name": ["Alice", "Bob", "Charlie", "David"],
    "age": [25, np.nan, 35, 40],
    "salary": [50000, 60000, np.nan, 80000]
}
df = pd.DataFrame(data)
print("Original dataframe:\n",df)

#*Filtering Rows
# Select rows where salary is greater than 50,000
filtered_df = df[df['salary'] > 50000]
print("\n",filtered_df)

#Selecting Specific Columns
selected_df = df[["name","salary"]]
print("\n",selected_df)

Original dataframe:
       name   age   salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
2  Charlie  35.0      NaN
3    David  40.0  80000.0

     name   age   salary
1    Bob   NaN  60000.0
3  David  40.0  80000.0

       name   salary
0    Alice  50000.0
1      Bob  60000.0
2  Charlie      NaN
3    David  80000.0

**Sorting Data**

In [4]:
#sorting by a single column
# Sort by salary in ascending order
sorted_df = df.sort_values(by="salary")
print("\n",sorted_df)

#Sorting in Descending Order
# Sort by age in descending order
sorted_df = df.sort_values(by="age", ascending=False)
print("\n",sorted_df)

       name   age   salary
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0
3    David  40.0  80000.0
2  Charlie  35.0      NaN

       name   age   salary
3    David  40.0  80000.0
2  Charlie  35.0      NaN
0    Alice  25.0  50000.0
1      Bob   NaN  60000.0

**Sort by age in descending order**

In [5]:
data = {
    "department": ["HR", "HR", "IT", "IT", "Sales", "Sales"],
    "employee": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank"],
    "salary": [50000, 60000, 70000, 80000, 45000, 55000]
}
df = pd.DataFrame(data)

#Group by and Aggregate
# Group by department and calculate the average salary
grouped_df = df.groupby("department")["salary"].mean()
print(grouped_df)

# Group by department and calculate both mean and max salary
grouped_agg = df.groupby("department")["salary"].agg(["mean","max"])
print("\n",grouped_agg)

department
HR       55000.0
IT       75000.0
Sales    50000.0
Name: salary, dtype: float64

                mean    max
department
HR          55000.0  60000
IT          75000.0  80000
Sales       50000.0  55000

**Adding New Columns**

Create a New Column

In [6]:
df["bonus"] = [1000,2000,3000,4000,5000,6000]
print(df)

# Add a new column "total_compensation" as salary + bonus
df["total_compensation"] = df["salary"] + df["bonus"]
print("\n",df)

  department employee  salary  bonus
0         HR    Alice   50000   1000
1         HR      Bob   60000   2000
2         IT  Charlie   70000   3000
3         IT    David   80000   4000
4      Sales      Eva   45000   5000
5      Sales    Frank   55000   6000

   department employee  salary  bonus  total_compensation
0         HR    Alice   50000   1000               51000
1         HR      Bob   60000   2000               62000
2         IT  Charlie   70000   3000               73000
3         IT    David   80000   4000               84000
4      Sales      Eva   45000   5000               50000
5      Sales    Frank   55000   6000               61000

**Applying Functions to Columns**

Using apply() for Custom Operations

In [7]:
# Increase all salaries by 10%
df["salary"] = df["salary"].apply(lambda x : x * 1.10)
print("\n",df)

   department employee   salary  bonus  total_compensation
0         HR    Alice  55000.0   1000               51000
1         HR      Bob  66000.0   2000               62000
2         IT  Charlie  77000.0   3000               73000
3         IT    David  88000.0   4000               84000
4      Sales      Eva  49500.0   5000               50000
5      Sales    Frank  60500.0   6000               61000

**Practice Task**

*Create a small DataFrame with columns like name, age, salary, and department. Try out the above operations:*

Filter rows where age > 30.


Sort by salary in descending order.

Group by department and calculate the average age.

Add a new column for increased salaries.

In [8]:
data = {
    "name" : ["Manya","Sushma","Sunil","Maya","Lokesh","nidhi"],
    "age" : [1,21,51,47,16,12],
    "salary" : [80000,70000,60000,45000,40000,30000],
    "department": ["HR", "IT", "Sales", "Sales", "IT", "HR"]
}

df = pd.DataFrame(data)
print(df)

filtered_df = df[df["age"] > 30]
print("\n",filtered_df)

sorted_df = df.sort_values(by="salary", ascending=False)
print("\n",sorted_df)

grouped_df = df.groupby("department")["age"].mean()
print("\n",grouped_df)

df["increased_salary"] = df["salary"] + 5000
print("\n",df)

     name  age  salary department
0   Manya    1   80000         HR
1  Sushma   21   70000         IT
2   Sunil   51   60000      Sales
3    Maya   47   45000      Sales
4  Lokesh   16   40000         IT
5   nidhi   12   30000         HR

     name  age  salary department
2  Sunil   51   60000      Sales
3   Maya   47   45000      Sales

      name  age  salary department
0   Manya    1   80000         HR
1  Sushma   21   70000         IT
2   Sunil   51   60000      Sales
3    Maya   47   45000      Sales
4  Lokesh   16   40000         IT
5   nidhi   12   30000         HR

 department
HR        6.5
IT       18.5
Sales    49.0
Name: age, dtype: float64

      name  age  salary department  increased_salary
0   Manya    1   80000         HR             85000
1  Sushma   21   70000         IT             75000
2   Sunil   51   60000      Sales             65000
3    Maya   47   45000      Sales             50000
4  Lokesh   16   40000         IT             45000
5   nidhi   12   30000         HR             35000

**Handling Missing Data**

In [9]:
#Sample data with missing values
data = {
    "name": ["Manya", "Sushma", "Sunil", "Maya", "Lokesh", "Nidhi"],
    "age": [1, 21, 51, None, 16, None],
    "salary": [80000, None, 60000, 45000, 40000, 30000]
}

df = pd.DataFrame(data)
print("Original DataFrame:\n", df)

# Fill missing values with a default value (e.g., 0 or a placeholder)
df_filled = df.fillna(0)
print("\nFilled Missing Values:\n",df_filled)

# Drop rows with missing values
df_dropped = df.dropna()
print("\nDropped Missing Values:\n",df_dropped)

Original DataFrame:
      name   age   salary
0   Manya   1.0  80000.0
1  Sushma  21.0      NaN
2   Sunil  51.0  60000.0
3    Maya   NaN  45000.0
4  Lokesh  16.0  40000.0
5   Nidhi   NaN  30000.0

Filled Missing Values:
      name   age   salary
0   Manya   1.0  80000.0
1  Sushma  21.0      0.0
2   Sunil  51.0  60000.0
3    Maya   0.0  45000.0
4  Lokesh  16.0  40000.0
5   Nidhi   0.0  30000.0

Dropped Missing Values:
      name   age   salary
0   Manya   1.0  80000.0
2   Sunil  51.0  60000.0
4  Lokesh  16.0  40000.0

**Renaming Columns**

In [10]:
# Rename the "salary" column to "monthly_income"
renamed = df.rename(columns={"salary" : "monthly_income"})
print("\nRenamed column:\n", renamed)

Renamed column:
      name   age  monthly_income
0   Manya   1.0         80000.0
1  Sushma  21.0             NaN
2   Sunil  51.0         60000.0
3    Maya   NaN         45000.0
4  Lokesh  16.0         40000.0
5   Nidhi   NaN         30000.0

**Merging and Joining DataFrames**

We can combine multiple DataFrames using merge(), join(), or concat().

In [11]:
# New DataFrame with additional information
new_data = {
    "name": ["Manya", "Sushma", "Sunil", "Maya", "Lokesh", "Nidhi"],
    "city": ["Pune", "Mumbai", "Delhi", "Chennai", "Bangalore", "Hyderabad"]
}

new_df = pd.DataFrame(new_data)

# Merge both DataFrames on the "name" column
merged_df = pd.merge(df, new_df, on="name")
print("\nMerged DataFrames:\n",merged_df)

Merged DataFrames:
      name   age   salary       city
0   Manya   1.0  80000.0       Pune
1  Sushma  21.0      NaN     Mumbai
2   Sunil  51.0  60000.0      Delhi
3    Maya   NaN  45000.0    Chennai
4  Lokesh  16.0  40000.0  Bangalore
5   Nidhi   NaN  30000.0  Hyderabad

**Pivot Tables**

Pivot tables are great for reshaping and summarizing data.

In [12]:
# Create a pivot table to calculate the average salary per department
data = {
    "department": ["HR", "IT", "Sales", "Sales", "IT", "HR"],
    "salary": [80000, 70000, 60000, 45000, 40000, 30000],
    "age": [1, 21, 51, 47, 16, 12]
}

df_pivot = pd.DataFrame(data)

# Create a pivot table summarizing average salary by department
pivot_table = df_pivot.pivot_table(values="salary", index="department", aggfunc="mean")
print("\npivot table:\n", pivot_table)

pivot table:
              salary
department
HR          55000.0
IT          55000.0
Sales       52500.0

**Multi-Level Indexing**

Multi-level indexing is used when we want to group and organize data by multiple levels.

In [13]:
# Create multi-level indexed DataFrame
data = {
    "department": ["HR", "HR", "IT", "IT", "Sales", "Sales"],
    "region": ["North", "South", "North", "South", "North", "South"],
    "salary": [80000, 30000, 70000, 40000, 60000, 45000]
}

df_multi = pd.DataFrame(data)
df_multi.set_index(["department","region"], inplace=True)
print("\nMulti-Level Indexed DataFrame:\n", df_multi)

Multi-Level Indexed DataFrame:
                    salary
department region
HR         North    80000
           South    30000
IT         North    70000
           South    40000
Sales      North    60000
           South    45000

**Filtering Rows Based on Multiple Conditions**

In [18]:
# Filter rows where salary is greater than 50000 and age is above 20
filtered_rows = df[(df["salary"] > 50000) & (df["age"] > 20)]
print("\n rows with salary greater than 50000 and age greater than 20:\n", filtered_rows)

 rows with salary greater tha 5000 and age greater than 20:
     name   age   salary
2  Sunil  51.0  60000.0

**Adding Calculated Columns**

In [20]:
# Add a column for annual salary (12 times the monthly salary)
df["annual_salary"] = df["salary"] * 12
print("\nDataFrame with Annual salary:\n",df)

DataFrame with Annual salary:
      name   age   salary  annual_salary
0   Manya   1.0  80000.0       960000.0
1  Sushma  21.0      NaN            NaN
2   Sunil  51.0  60000.0       720000.0
3    Maya   NaN  45000.0       540000.0
4  Lokesh  16.0  40000.0       480000.0
5   Nidhi   NaN  30000.0       360000.0

**Sorting by Multiple Columns**

In [21]:
# Sort by "salary" in descending order and by "age" in ascending order
sorted_df = df.sort_values(by=["salary","age"], ascending=[False,True])
print("\nsorted by salary (Descending) and age (Ascending): \n",sorted_df)

sorted by salary (Descending) and age (Ascending):
      name   age   salary  annual_salary
0   Manya   1.0  80000.0       960000.0
2   Sunil  51.0  60000.0       720000.0
3    Maya   NaN  45000.0       540000.0
4  Lokesh  16.0  40000.0       480000.0
5   Nidhi   NaN  30000.0       360000.0
1  Sushma  21.0      NaN            NaN

**Grouping and Aggregating with Multiple Functions**

In [28]:
#add a Department column to the DataFrame
df["department"] = ["HR", "HR", "IT", "IT", "Sales", "Sales"]
print("\nDataFrame with department:\n",df)

# Group by department and calculate mean and max salary
grouped_multi = df.groupby("department")["annual_salary"].agg(["mean","max"])
print("\nGrouped by Department (Mean and Max salary):\n", grouped_multi)

DataFrame with department:
      name   age   salary  annual_salary department
0   Manya   1.0  80000.0       960000.0         HR
1  Sushma  21.0      NaN            NaN         HR
2   Sunil  51.0  60000.0       720000.0         IT
3    Maya   NaN  45000.0       540000.0         IT
4  Lokesh  16.0  40000.0       480000.0      Sales
5   Nidhi   NaN  30000.0       360000.0      Sales

Grouped by Department (Mean and Max salary):
                 mean       max
department
HR          960000.0  960000.0
IT          630000.0  720000.0
Sales       420000.0  480000.0

**Exporting Data to a CSV File**

In [29]:
# Export the DataFrame to a CSV file
df.to_csv("exported_data.csv", index=False)
print("\nData exported to 'exported_data.csv'.")

Data exported to 'exported_data.csv'.